---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.GlobalParamFormulaCircularChainError
source: html/0f949cd0-c987-8fa6-5ed2-74d44de3fddb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.GlobalParamFormulaCircularChainError Property

A formula in a global parameter causes a circular chain of references between highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId GlobalParamFormulaCircularChainError { get; }
```